app/Controllers/CampaignController.php

SELECT *
FROM `campaigns`
---
    public function loadCampaigns()
    {
        $data['campaigns'] = $this->campaignModel->findAll();

INSERT INTO `campaigns` (`name`, `created_at`, `updated_at`) VALUES ('Momai', '2023-04-17 11:39:35', '2023-04-17 11:39:35')
---
    public function createCampaign()
    {
        if ($this->request->getMethod() === 'post') {
            $campaignData = [
                'name' => $this->request->getPost('name')
            ];

            $this->campaignModel->insert($campaignData);