app/Controllers/DashboardController.php

SELECT *
FROM `campaigns`
WHERE `campaigns`.`id` = '5'
---
    public function index($campaignId)
    {
        // Get the campaign name
        $campaign = $this->campaignModel->find($campaignId);